zengwangfa/Underwater-Vehicle/software/18.8.21最终)/Chip/inc/kinetis/MK61F12.h
/* ADC - Register instance definitions */
/* ADC0 */
#define ADC0_SC1A                                ADC_SC1_REG(ADC0_BASE_PTR,0)
#define ADC0_SC1B                                ADC_SC1_REG(ADC0_BASE_PTR,1)
#define ADC0_CFG1                                ADC_CFG1_REG(ADC0_BASE_PTR)
#define ADC0_CFG2                                ADC_CFG2_REG(ADC0_BASE_PTR)
#define ADC0_RA                                  ADC_R_REG(ADC0_BASE_PTR,0)
#define ADC0_RB                                  ADC_R_REG(ADC0_BASE_PTR,1)
#define ADC0_CV1                                 ADC_CV1_REG(ADC0_BASE_PTR)
#define ADC0_CV2                                 ADC_CV2_REG(ADC0_BASE_PTR)
#define ADC0_SC2                                 ADC_SC2_REG(ADC0_BASE_PTR)
#define ADC0_SC3                                 ADC_SC3_REG(ADC0_BASE_PTR)
#define ADC0_OFS                                 ADC_OFS_REG(ADC0_BASE_PTR)
#define ADC0_PG                                  ADC_PG_REG(ADC0_BASE_PTR)
#define ADC0_MG                                  ADC_MG_REG(ADC0_BASE_PTR)
#define ADC0_CLPD                                ADC_CLPD_REG(ADC0_BASE_PTR)
#define ADC0_CLPS                                ADC_CLPS_REG(ADC0_BASE_PTR)
#define ADC0_CLP4                                ADC_CLP4_REG(ADC0_BASE_PTR)
#define ADC0_CLP3                                ADC_CLP3_REG(ADC0_BASE_PTR)
#define ADC0_CLP2                                ADC_CLP2_REG(ADC0_BASE_PTR)
#define ADC0_CLP1                                ADC_CLP1_REG(ADC0_BASE_PTR)
#define ADC0_CLP0                                ADC_CLP0_REG(ADC0_BASE_PTR)
#define ADC0_PGA                                 ADC_PGA_REG(ADC0_BASE_PTR)
#define ADC0_CLMD                                ADC_CLMD_REG(ADC0_BASE_PTR)
#define ADC0_CLMS                                ADC_CLMS_REG(ADC0_BASE_PTR)
#define ADC0_CLM4                                ADC_CLM4_REG(ADC0_BASE_PTR)
#define ADC0_CLM3                                ADC_CLM3_REG(ADC0_BASE_PTR)
#define ADC0_CLM2                                ADC_CLM2_REG(ADC0_BASE_PTR)
#define ADC0_CLM1                                ADC_CLM1_REG(ADC0_BASE_PTR)
#define ADC0_CLM0                                ADC_CLM0_REG(ADC0_BASE_PTR)
/* ADC1 */
#define ADC1_SC1A                                ADC_SC1_REG(ADC1_BASE_PTR,0)
#define ADC1_SC1B                                ADC_SC1_REG(ADC1_BASE_PTR,1)
#define ADC1_CFG1                                ADC_CFG1_REG(ADC1_BASE_PTR)
#define ADC1_CFG2                                ADC_CFG2_REG(ADC1_BASE_PTR)
#define ADC1_RA                                  ADC_R_REG(ADC1_BASE_PTR,0)
#define ADC1_RB                                  ADC_R_REG(ADC1_BASE_PTR,1)
#define ADC1_CV1                                 ADC_CV1_REG(ADC1_BASE_PTR)
#define ADC1_CV2                                 ADC_CV2_REG(ADC1_BASE_PTR)
#define ADC1_SC2                                 ADC_SC2_REG(ADC1_BASE_PTR)
#define ADC1_SC3                                 ADC_SC3_REG(ADC1_BASE_PTR)
#define ADC1_OFS                                 ADC_OFS_REG(ADC1_BASE_PTR)
#define ADC1_PG                                  ADC_PG_REG(ADC1_BASE_PTR)
#define ADC1_MG                                  ADC_MG_REG(ADC1_BASE_PTR)
#define ADC1_CLPD                                ADC_CLPD_REG(ADC1_BASE_PTR)
#define ADC1_CLPS                                ADC_CLPS_REG(ADC1_BASE_PTR)
#define ADC1_CLP4                                ADC_CLP4_REG(ADC1_BASE_PTR)
#define ADC1_CLP3                                ADC_CLP3_REG(ADC1_BASE_PTR)
#define ADC1_CLP2                                ADC_CLP2_REG(ADC1_BASE_PTR)
#define ADC1_CLP1                                ADC_CLP1_REG(ADC1_BASE_PTR)
#define ADC1_CLP0                                ADC_CLP0_REG(ADC1_BASE_PTR)
#define ADC1_PGA                                 ADC_PGA_REG(ADC1_BASE_PTR)
#define ADC1_CLMD                                ADC_CLMD_REG(ADC1_BASE_PTR)
#define ADC1_CLMS                                ADC_CLMS_REG(ADC1_BASE_PTR)
#define ADC1_CLM4                                ADC_CLM4_REG(ADC1_BASE_PTR)
#define ADC1_CLM3                                ADC_CLM3_REG(ADC1_BASE_PTR)
#define ADC1_CLM2                                ADC_CLM2_REG(ADC1_BASE_PTR)
#define ADC1_CLM1                                ADC_CLM1_REG(ADC1_BASE_PTR)
#define ADC1_CLM0                                ADC_CLM0_REG(ADC1_BASE_PTR)
/* ADC2 */
#define ADC2_SC1A                                ADC_SC1_REG(ADC2_BASE_PTR,0)
#define ADC2_SC1B                                ADC_SC1_REG(ADC2_BASE_PTR,1)
#define ADC2_CFG1                                ADC_CFG1_REG(ADC2_BASE_PTR)
#define ADC2_CFG2                                ADC_CFG2_REG(ADC2_BASE_PTR)
#define ADC2_RA                                  ADC_R_REG(ADC2_BASE_PTR,0)
#define ADC2_RB                                  ADC_R_REG(ADC2_BASE_PTR,1)
#define ADC2_CV1                                 ADC_CV1_REG(ADC2_BASE_PTR)
#define ADC2_CV2                                 ADC_CV2_REG(ADC2_BASE_PTR)
#define ADC2_SC2                                 ADC_SC2_REG(ADC2_BASE_PTR)
#define ADC2_SC3                                 ADC_SC3_REG(ADC2_BASE_PTR)
#define ADC2_OFS                                 ADC_OFS_REG(ADC2_BASE_PTR)
#define ADC2_PG                                  ADC_PG_REG(ADC2_BASE_PTR)
#define ADC2_MG                                  ADC_MG_REG(ADC2_BASE_PTR)
#define ADC2_CLPD                                ADC_CLPD_REG(ADC2_BASE_PTR)
#define ADC2_CLPS                                ADC_CLPS_REG(ADC2_BASE_PTR)
#define ADC2_CLP4                                ADC_CLP4_REG(ADC2_BASE_PTR)
#define ADC2_CLP3                                ADC_CLP3_REG(ADC2_BASE_PTR)
#define ADC2_CLP2                                ADC_CLP2_REG(ADC2_BASE_PTR)
#define ADC2_CLP1                                ADC_CLP1_REG(ADC2_BASE_PTR)
#define ADC2_CLP0                                ADC_CLP0_REG(ADC2_BASE_PTR)
#define ADC2_PGA                                 ADC_PGA_REG(ADC2_BASE_PTR)
#define ADC2_CLMD                                ADC_CLMD_REG(ADC2_BASE_PTR)
#define ADC2_CLMS                                ADC_CLMS_REG(ADC2_BASE_PTR)
#define ADC2_CLM4                                ADC_CLM4_REG(ADC2_BASE_PTR)
#define ADC2_CLM3                                ADC_CLM3_REG(ADC2_BASE_PTR)
#define ADC2_CLM2                                ADC_CLM2_REG(ADC2_BASE_PTR)
#define ADC2_CLM1                                ADC_CLM1_REG(ADC2_BASE_PTR)
#define ADC2_CLM0                                ADC_CLM0_REG(ADC2_BASE_PTR)
/* ADC3 */
#define ADC3_SC1A                                ADC_SC1_REG(ADC3_BASE_PTR,0)
#define ADC3_SC1B                                ADC_SC1_REG(ADC3_BASE_PTR,1)
#define ADC3_CFG1                                ADC_CFG1_REG(ADC3_BASE_PTR)
#define ADC3_CFG2                                ADC_CFG2_REG(ADC3_BASE_PTR)
#define ADC3_RA                                  ADC_R_REG(ADC3_BASE_PTR,0)
#define ADC3_RB                                  ADC_R_REG(ADC3_BASE_PTR,1)
#define ADC3_CV1                                 ADC_CV1_REG(ADC3_BASE_PTR)
#define ADC3_CV2                                 ADC_CV2_REG(ADC3_BASE_PTR)
#define ADC3_SC2                                 ADC_SC2_REG(ADC3_BASE_PTR)
#define ADC3_SC3                                 ADC_SC3_REG(ADC3_BASE_PTR)
#define ADC3_OFS                                 ADC_OFS_REG(ADC3_BASE_PTR)
#define ADC3_PG                                  ADC_PG_REG(ADC3_BASE_PTR)
#define ADC3_MG                                  ADC_MG_REG(ADC3_BASE_PTR)
#define ADC3_CLPD                                ADC_CLPD_REG(ADC3_BASE_PTR)
#define ADC3_CLPS                                ADC_CLPS_REG(ADC3_BASE_PTR)
#define ADC3_CLP4                                ADC_CLP4_REG(ADC3_BASE_PTR)
#define ADC3_CLP3                                ADC_CLP3_REG(ADC3_BASE_PTR)
#define ADC3_CLP2                                ADC_CLP2_REG(ADC3_BASE_PTR)
#define ADC3_CLP1                                ADC_CLP1_REG(ADC3_BASE_PTR)
#define ADC3_CLP0                                ADC_CLP0_REG(ADC3_BASE_PTR)
#define ADC3_PGA                                 ADC_PGA_REG(ADC3_BASE_PTR)
#define ADC3_CLMD                                ADC_CLMD_REG(ADC3_BASE_PTR)
#define ADC3_CLMS                                ADC_CLMS_REG(ADC3_BASE_PTR)
#define ADC3_CLM4                                ADC_CLM4_REG(ADC3_BASE_PTR)
#define ADC3_CLM3                                ADC_CLM3_REG(ADC3_BASE_PTR)
#define ADC3_CLM2                                ADC_CLM2_REG(ADC3_BASE_PTR)
#define ADC3_CLM1                                ADC_CLM1_REG(ADC3_BASE_PTR)
#define ADC3_CLM0                                ADC_CLM0_REG(ADC3_BASE_PTR)

/* ADC - Register array accessors */
#define ADC0_SC1(index)                          ADC_SC1_REG(ADC0_BASE_PTR,index)
#define ADC1_SC1(index)                          ADC_SC1_REG(ADC1_BASE_PTR,index)
#define ADC2_SC1(index)                          ADC_SC1_REG(ADC2_BASE_PTR,index)
#define ADC3_SC1(index)                          ADC_SC1_REG(ADC3_BASE_PTR,index)
#define ADC0_R(index)                            ADC_R_REG(ADC0_BASE_PTR,index)
#define ADC1_R(index)                            ADC_R_REG(ADC1_BASE_PTR,index)
#define ADC2_R(index)                            ADC_R_REG(ADC2_BASE_PTR,index)
#define ADC3_R(index)                            ADC_R_REG(ADC3_BASE_PTR,index)

/**
 * @}
 */ /* end of group ADC_Register_Accessor_Macros */


/**
 * @}
 */ /* end of group ADC_Peripheral */


/* ----------------------------------------------------------------------------
   -- AIPS
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup AIPS_Peripheral AIPS
 * @{
 */

