zengwangfa/Underwater-Vehicle/software/18.8.21最终)/Chip/inc/kinetis/MK61F12.h
#define DDR_CR41_P1RDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR41_P1RDCNT_SHIFT))&DDR_CR41_P1RDCNT_MASK)
#define DDR_CR41_RP1_MASK                        0x30000u
#define DDR_CR41_RP1_SHIFT                       16
#define DDR_CR41_RP1(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR41_RP1_SHIFT))&DDR_CR41_RP1_MASK)
#define DDR_CR41_WP1_MASK                        0x3000000u
#define DDR_CR41_WP1_SHIFT                       24
#define DDR_CR41_WP1(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR41_WP1_SHIFT))&DDR_CR41_WP1_MASK)
/* CR42 Bit Fields */
#define DDR_CR42_P1TYP_MASK                      0x3u
#define DDR_CR42_P1TYP_SHIFT                     0
#define DDR_CR42_P1TYP(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR42_P1TYP_SHIFT))&DDR_CR42_P1TYP_MASK)
#define DDR_CR42_P2WRCNT_MASK                    0x7FF00u
#define DDR_CR42_P2WRCNT_SHIFT                   8
#define DDR_CR42_P2WRCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR42_P2WRCNT_SHIFT))&DDR_CR42_P2WRCNT_MASK)
/* CR43 Bit Fields */
#define DDR_CR43_P2RDCNT_MASK                    0x7FFu
#define DDR_CR43_P2RDCNT_SHIFT                   0
#define DDR_CR43_P2RDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR43_P2RDCNT_SHIFT))&DDR_CR43_P2RDCNT_MASK)
#define DDR_CR43_RP2_MASK                        0x30000u
#define DDR_CR43_RP2_SHIFT                       16
#define DDR_CR43_RP2(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR43_RP2_SHIFT))&DDR_CR43_RP2_MASK)
#define DDR_CR43_WP2_MASK                        0x3000000u
#define DDR_CR43_WP2_SHIFT                       24
#define DDR_CR43_WP2(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR43_WP2_SHIFT))&DDR_CR43_WP2_MASK)
/* CR44 Bit Fields */
#define DDR_CR44_P2TYP_MASK                      0x3u
#define DDR_CR44_P2TYP_SHIFT                     0
#define DDR_CR44_P2TYP(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR44_P2TYP_SHIFT))&DDR_CR44_P2TYP_MASK)
#define DDR_CR44_WRRLAT_MASK                     0x100u
#define DDR_CR44_WRRLAT_SHIFT                    8
#define DDR_CR44_WRRSHARE_MASK                   0x10000u
#define DDR_CR44_WRRSHARE_SHIFT                  16
#define DDR_CR44_WRRERR_MASK                     0xF000000u
#define DDR_CR44_WRRERR_SHIFT                    24
#define DDR_CR44_WRRERR(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR44_WRRERR_SHIFT))&DDR_CR44_WRRERR_MASK)
/* CR45 Bit Fields */
#define DDR_CR45_P0PRI0_MASK                     0xFu
#define DDR_CR45_P0PRI0_SHIFT                    0
#define DDR_CR45_P0PRI0(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR45_P0PRI0_SHIFT))&DDR_CR45_P0PRI0_MASK)
#define DDR_CR45_P0PRI1_MASK                     0xF00u
#define DDR_CR45_P0PRI1_SHIFT                    8
#define DDR_CR45_P0PRI1(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR45_P0PRI1_SHIFT))&DDR_CR45_P0PRI1_MASK)
#define DDR_CR45_P0PRI2_MASK                     0xF0000u
#define DDR_CR45_P0PRI2_SHIFT                    16
#define DDR_CR45_P0PRI2(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR45_P0PRI2_SHIFT))&DDR_CR45_P0PRI2_MASK)
#define DDR_CR45_P0PRI3_MASK                     0xF000000u
#define DDR_CR45_P0PRI3_SHIFT                    24
#define DDR_CR45_P0PRI3(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR45_P0PRI3_SHIFT))&DDR_CR45_P0PRI3_MASK)
/* CR46 Bit Fields */
#define DDR_CR46_P0ORD_MASK                      0x3u
#define DDR_CR46_P0ORD_SHIFT                     0
#define DDR_CR46_P0ORD(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR46_P0ORD_SHIFT))&DDR_CR46_P0ORD_MASK)
#define DDR_CR46_P0PRIRLX_MASK                   0x3FF00u
#define DDR_CR46_P0PRIRLX_SHIFT                  8
#define DDR_CR46_P0PRIRLX(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR46_P0PRIRLX_SHIFT))&DDR_CR46_P0PRIRLX_MASK)
#define DDR_CR46_P1PRI0_MASK                     0xF000000u
#define DDR_CR46_P1PRI0_SHIFT                    24
#define DDR_CR46_P1PRI0(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR46_P1PRI0_SHIFT))&DDR_CR46_P1PRI0_MASK)
/* CR47 Bit Fields */
#define DDR_CR47_P1PRI1_MASK                     0xFu
#define DDR_CR47_P1PRI1_SHIFT                    0
#define DDR_CR47_P1PRI1(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR47_P1PRI1_SHIFT))&DDR_CR47_P1PRI1_MASK)
#define DDR_CR47_P1PRI2_MASK                     0xF00u
#define DDR_CR47_P1PRI2_SHIFT                    8
#define DDR_CR47_P1PRI2(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR47_P1PRI2_SHIFT))&DDR_CR47_P1PRI2_MASK)
#define DDR_CR47_P1PRI3_MASK                     0xF0000u
#define DDR_CR47_P1PRI3_SHIFT                    16
#define DDR_CR47_P1PRI3(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR47_P1PRI3_SHIFT))&DDR_CR47_P1PRI3_MASK)
#define DDR_CR47_P1ORD_MASK                      0x3000000u
#define DDR_CR47_P1ORD_SHIFT                     24
#define DDR_CR47_P1ORD(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR47_P1ORD_SHIFT))&DDR_CR47_P1ORD_MASK)
/* CR48 Bit Fields */
#define DDR_CR48_P1PRIRLX_MASK                   0x3FFu
#define DDR_CR48_P1PRIRLX_SHIFT                  0
#define DDR_CR48_P1PRIRLX(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR48_P1PRIRLX_SHIFT))&DDR_CR48_P1PRIRLX_MASK)
#define DDR_CR48_P2PRI0_MASK                     0xF0000u
#define DDR_CR48_P2PRI0_SHIFT                    16
#define DDR_CR48_P2PRI0(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR48_P2PRI0_SHIFT))&DDR_CR48_P2PRI0_MASK)
#define DDR_CR48_P2PRI1_MASK                     0xF000000u
#define DDR_CR48_P2PRI1_SHIFT                    24
#define DDR_CR48_P2PRI1(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR48_P2PRI1_SHIFT))&DDR_CR48_P2PRI1_MASK)
/* CR49 Bit Fields */
#define DDR_CR49_P2PRI2_MASK                     0xFu
#define DDR_CR49_P2PRI2_SHIFT                    0
#define DDR_CR49_P2PRI2(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR49_P2PRI2_SHIFT))&DDR_CR49_P2PRI2_MASK)
#define DDR_CR49_P2PRI3_MASK                     0xF00u
#define DDR_CR49_P2PRI3_SHIFT                    8
#define DDR_CR49_P2PRI3(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR49_P2PRI3_SHIFT))&DDR_CR49_P2PRI3_MASK)
#define DDR_CR49_P2ORD_MASK                      0x30000u
#define DDR_CR49_P2ORD_SHIFT                     16
#define DDR_CR49_P2ORD(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR49_P2ORD_SHIFT))&DDR_CR49_P2ORD_MASK)
/* CR50 Bit Fields */
#define DDR_CR50_P2PRIRLX_MASK                   0x3FFu
#define DDR_CR50_P2PRIRLX_SHIFT                  0
#define DDR_CR50_P2PRIRLX(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR50_P2PRIRLX_SHIFT))&DDR_CR50_P2PRIRLX_MASK)
#define DDR_CR50_CLKSTATUS_MASK                  0x10000u
#define DDR_CR50_CLKSTATUS_SHIFT                 16
/* CR51 Bit Fields */
#define DDR_CR51_DLLRSTDLY_MASK                  0xFFFFu
#define DDR_CR51_DLLRSTDLY_SHIFT                 0
#define DDR_CR51_DLLRSTDLY(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR51_DLLRSTDLY_SHIFT))&DDR_CR51_DLLRSTDLY_MASK)
#define DDR_CR51_DLLRADLY_MASK                   0xFF0000u
#define DDR_CR51_DLLRADLY_SHIFT                  16
#define DDR_CR51_DLLRADLY(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR51_DLLRADLY_SHIFT))&DDR_CR51_DLLRADLY_MASK)
#define DDR_CR51_PHYWRLAT_MASK                   0xF000000u
#define DDR_CR51_PHYWRLAT_SHIFT                  24
#define DDR_CR51_PHYWRLAT(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR51_PHYWRLAT_SHIFT))&DDR_CR51_PHYWRLAT_MASK)
/* CR52 Bit Fields */
#define DDR_CR52_PYWRLTBS_MASK                   0xFu
#define DDR_CR52_PYWRLTBS_SHIFT                  0
#define DDR_CR52_PYWRLTBS(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR52_PYWRLTBS_SHIFT))&DDR_CR52_PYWRLTBS_MASK)
#define DDR_CR52_PHYRDLAT_MASK                   0xF00u
#define DDR_CR52_PHYRDLAT_SHIFT                  8
#define DDR_CR52_PHYRDLAT(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR52_PHYRDLAT_SHIFT))&DDR_CR52_PHYRDLAT_MASK)
#define DDR_CR52_RDDATAEN_MASK                   0xF0000u
#define DDR_CR52_RDDATAEN_SHIFT                  16
#define DDR_CR52_RDDATAEN(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR52_RDDATAEN_SHIFT))&DDR_CR52_RDDATAEN_MASK)
#define DDR_CR52_RDDTENBAS_MASK                  0xF000000u
#define DDR_CR52_RDDTENBAS_SHIFT                 24
#define DDR_CR52_RDDTENBAS(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR52_RDDTENBAS_SHIFT))&DDR_CR52_RDDTENBAS_MASK)
/* CR53 Bit Fields */
#define DDR_CR53_CLKDISCS_MASK                   0x1u
#define DDR_CR53_CLKDISCS_SHIFT                  0
#define DDR_CR53_CRTLUPDMN_MASK                  0xF00u
#define DDR_CR53_CRTLUPDMN_SHIFT                 8
#define DDR_CR53_CRTLUPDMN(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR53_CRTLUPDMN_SHIFT))&DDR_CR53_CRTLUPDMN_MASK)
#define DDR_CR53_CTRLUPDMX_MASK                  0x3FFF0000u
#define DDR_CR53_CTRLUPDMX_SHIFT                 16
#define DDR_CR53_CTRLUPDMX(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR53_CTRLUPDMX_SHIFT))&DDR_CR53_CTRLUPDMX_MASK)
/* CR54 Bit Fields */
#define DDR_CR54_PHYUPDTY0_MASK                  0x3FFFu
#define DDR_CR54_PHYUPDTY0_SHIFT                 0
#define DDR_CR54_PHYUPDTY0(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR54_PHYUPDTY0_SHIFT))&DDR_CR54_PHYUPDTY0_MASK)
#define DDR_CR54_PHYUPDTY1_MASK                  0x3FFF0000u
#define DDR_CR54_PHYUPDTY1_SHIFT                 16
#define DDR_CR54_PHYUPDTY1(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR54_PHYUPDTY1_SHIFT))&DDR_CR54_PHYUPDTY1_MASK)
/* CR55 Bit Fields */
#define DDR_CR55_PHYUPDTY2_MASK                  0x3FFFu
#define DDR_CR55_PHYUPDTY2_SHIFT                 0
#define DDR_CR55_PHYUPDTY2(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR55_PHYUPDTY2_SHIFT))&DDR_CR55_PHYUPDTY2_MASK)
#define DDR_CR55_PHYUPDTY3_MASK                  0x3FFF0000u
#define DDR_CR55_PHYUPDTY3_SHIFT                 16
#define DDR_CR55_PHYUPDTY3(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR55_PHYUPDTY3_SHIFT))&DDR_CR55_PHYUPDTY3_MASK)
/* CR56 Bit Fields */
#define DDR_CR56_PHYUPDRESP_MASK                 0x3FFFu
#define DDR_CR56_PHYUPDRESP_SHIFT                0
#define DDR_CR56_PHYUPDRESP(x)                   (((uint32_t)(((uint32_t)(x))<<DDR_CR56_PHYUPDRESP_SHIFT))&DDR_CR56_PHYUPDRESP_MASK)
#define DDR_CR56_RDLATADJ_MASK                   0xF0000u
#define DDR_CR56_RDLATADJ_SHIFT                  16
#define DDR_CR56_RDLATADJ(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR56_RDLATADJ_SHIFT))&DDR_CR56_RDLATADJ_MASK)
#define DDR_CR56_WRLATADJ_MASK                   0xF000000u
#define DDR_CR56_WRLATADJ_SHIFT                  24
#define DDR_CR56_WRLATADJ(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR56_WRLATADJ_SHIFT))&DDR_CR56_WRLATADJ_MASK)
/* CR57 Bit Fields */
#define DDR_CR57_CMDDLY_MASK                     0xFu
#define DDR_CR57_CMDDLY_SHIFT                    0
#define DDR_CR57_CMDDLY(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR57_CMDDLY_SHIFT))&DDR_CR57_CMDDLY_MASK)
#define DDR_CR57_CLKDISDLY_MASK                  0x700u
#define DDR_CR57_CLKDISDLY_SHIFT                 8
#define DDR_CR57_CLKDISDLY(x)                    (((uint32_t)(((uint32_t)(x))<<DDR_CR57_CLKDISDLY_SHIFT))&DDR_CR57_CLKDISDLY_MASK)
#define DDR_CR57_CLKENDLY_MASK                   0xF0000u
#define DDR_CR57_CLKENDLY_SHIFT                  16
#define DDR_CR57_CLKENDLY(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR57_CLKENDLY_SHIFT))&DDR_CR57_CLKENDLY_MASK)
#define DDR_CR57_ODTALTEN_MASK                   0x1000000u
#define DDR_CR57_ODTALTEN_SHIFT                  24
/* CR58 Bit Fields */
#define DDR_CR58_Not_Used_MASK                   0xFFFFu
#define DDR_CR58_Not_Used_SHIFT                  0
#define DDR_CR58_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR58_Not_Used_SHIFT))&DDR_CR58_Not_Used_MASK)
#define DDR_CR58_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR58_NOT_USED_SHIFT                  16
#define DDR_CR58_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR58_NOT_USED_SHIFT))&DDR_CR58_NOT_USED_MASK)
/* CR59 Bit Fields */
#define DDR_CR59_Not_Used_MASK                   0xFFFFu
#define DDR_CR59_Not_Used_SHIFT                  0
#define DDR_CR59_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR59_Not_Used_SHIFT))&DDR_CR59_Not_Used_MASK)
#define DDR_CR59_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR59_NOT_USED_SHIFT                  16
#define DDR_CR59_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR59_NOT_USED_SHIFT))&DDR_CR59_NOT_USED_MASK)
/* CR60 Bit Fields */
#define DDR_CR60_Not_Used_MASK                   0xFFFFu
#define DDR_CR60_Not_Used_SHIFT                  0
#define DDR_CR60_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR60_Not_Used_SHIFT))&DDR_CR60_Not_Used_MASK)
#define DDR_CR60_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR60_NOT_USED_SHIFT                  16
#define DDR_CR60_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR60_NOT_USED_SHIFT))&DDR_CR60_NOT_USED_MASK)
/* CR61 Bit Fields */
#define DDR_CR61_Not_Used_MASK                   0xFFFFu
#define DDR_CR61_Not_Used_SHIFT                  0
#define DDR_CR61_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR61_Not_Used_SHIFT))&DDR_CR61_Not_Used_MASK)
#define DDR_CR61_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR61_NOT_USED_SHIFT                  16
#define DDR_CR61_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR61_NOT_USED_SHIFT))&DDR_CR61_NOT_USED_MASK)
/* CR62 Bit Fields */
#define DDR_CR62_Not_Used_MASK                   0xFFFFu
#define DDR_CR62_Not_Used_SHIFT                  0
#define DDR_CR62_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR62_Not_Used_SHIFT))&DDR_CR62_Not_Used_MASK)
#define DDR_CR62_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR62_NOT_USED_SHIFT                  16
#define DDR_CR62_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR62_NOT_USED_SHIFT))&DDR_CR62_NOT_USED_MASK)
/* CR63 Bit Fields */
#define DDR_CR63_Not_Used_MASK                   0xFFFFu
#define DDR_CR63_Not_Used_SHIFT                  0
#define DDR_CR63_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR63_Not_Used_SHIFT))&DDR_CR63_Not_Used_MASK)
#define DDR_CR63_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR63_NOT_USED_SHIFT                  16
#define DDR_CR63_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR63_NOT_USED_SHIFT))&DDR_CR63_NOT_USED_MASK)
/* RCR Bit Fields */
#define DDR_RCR_RST_MASK                         0x40000000u
#define DDR_RCR_RST_SHIFT                        30

/**
 * @}
 */ /* end of group DDR_Register_Masks */


/* DDR - Peripheral instance base addresses */
/** Peripheral DDR base pointer */
#define DDR_BASE_PTR                             ((DDR_MemMapPtr)0x400AE000u)

/* ----------------------------------------------------------------------------
   -- DDR - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup DDR_Register_Accessor_Macros DDR - Register accessor macros
 * @{
 */


/* DDR - Register instance definitions */
/* DDR */
#define DDR_CR00                                 DDR_CR00_REG(DDR_BASE_PTR)
#define DDR_CR01                                 DDR_CR01_REG(DDR_BASE_PTR)
#define DDR_CR02                                 DDR_CR02_REG(DDR_BASE_PTR)
#define DDR_CR03                                 DDR_CR03_REG(DDR_BASE_PTR)
#define DDR_CR04                                 DDR_CR04_REG(DDR_BASE_PTR)
#define DDR_CR05                                 DDR_CR05_REG(DDR_BASE_PTR)
#define DDR_CR06                                 DDR_CR06_REG(DDR_BASE_PTR)
#define DDR_CR07                                 DDR_CR07_REG(DDR_BASE_PTR)
#define DDR_CR08                                 DDR_CR08_REG(DDR_BASE_PTR)
#define DDR_CR09                                 DDR_CR09_REG(DDR_BASE_PTR)
#define DDR_CR10                                 DDR_CR10_REG(DDR_BASE_PTR)
#define DDR_CR11                                 DDR_CR11_REG(DDR_BASE_PTR)
#define DDR_CR12                                 DDR_CR12_REG(DDR_BASE_PTR)
#define DDR_CR13                                 DDR_CR13_REG(DDR_BASE_PTR)
#define DDR_CR14                                 DDR_CR14_REG(DDR_BASE_PTR)
#define DDR_CR15                                 DDR_CR15_REG(DDR_BASE_PTR)
#define DDR_CR16                                 DDR_CR16_REG(DDR_BASE_PTR)
#define DDR_CR17                                 DDR_CR17_REG(DDR_BASE_PTR)
#define DDR_CR18                                 DDR_CR18_REG(DDR_BASE_PTR)
#define DDR_CR19                                 DDR_CR19_REG(DDR_BASE_PTR)
#define DDR_CR20                                 DDR_CR20_REG(DDR_BASE_PTR)
#define DDR_CR21                                 DDR_CR21_REG(DDR_BASE_PTR)
#define DDR_CR22                                 DDR_CR22_REG(DDR_BASE_PTR)
#define DDR_CR23                                 DDR_CR23_REG(DDR_BASE_PTR)
#define DDR_CR24                                 DDR_CR24_REG(DDR_BASE_PTR)
#define DDR_CR25                                 DDR_CR25_REG(DDR_BASE_PTR)
#define DDR_CR26                                 DDR_CR26_REG(DDR_BASE_PTR)
#define DDR_CR27                                 DDR_CR27_REG(DDR_BASE_PTR)
#define DDR_CR28                                 DDR_CR28_REG(DDR_BASE_PTR)
#define DDR_CR29                                 DDR_CR29_REG(DDR_BASE_PTR)
#define DDR_CR30                                 DDR_CR30_REG(DDR_BASE_PTR)
#define DDR_CR31                                 DDR_CR31_REG(DDR_BASE_PTR)
#define DDR_CR32                                 DDR_CR32_REG(DDR_BASE_PTR)
#define DDR_CR33                                 DDR_CR33_REG(DDR_BASE_PTR)
#define DDR_CR34                                 DDR_CR34_REG(DDR_BASE_PTR)
#define DDR_CR35                                 DDR_CR35_REG(DDR_BASE_PTR)
#define DDR_CR36                                 DDR_CR36_REG(DDR_BASE_PTR)
#define DDR_CR37                                 DDR_CR37_REG(DDR_BASE_PTR)
#define DDR_CR38                                 DDR_CR38_REG(DDR_BASE_PTR)
#define DDR_CR39                                 DDR_CR39_REG(DDR_BASE_PTR)
#define DDR_CR40                                 DDR_CR40_REG(DDR_BASE_PTR)
#define DDR_CR41                                 DDR_CR41_REG(DDR_BASE_PTR)
#define DDR_CR42                                 DDR_CR42_REG(DDR_BASE_PTR)
#define DDR_CR43                                 DDR_CR43_REG(DDR_BASE_PTR)
#define DDR_CR44                                 DDR_CR44_REG(DDR_BASE_PTR)
#define DDR_CR45                                 DDR_CR45_REG(DDR_BASE_PTR)
#define DDR_CR46                                 DDR_CR46_REG(DDR_BASE_PTR)
#define DDR_CR47                                 DDR_CR47_REG(DDR_BASE_PTR)
#define DDR_CR48                                 DDR_CR48_REG(DDR_BASE_PTR)
#define DDR_CR49                                 DDR_CR49_REG(DDR_BASE_PTR)
#define DDR_CR50                                 DDR_CR50_REG(DDR_BASE_PTR)
#define DDR_CR51                                 DDR_CR51_REG(DDR_BASE_PTR)
#define DDR_CR52                                 DDR_CR52_REG(DDR_BASE_PTR)
#define DDR_CR53                                 DDR_CR53_REG(DDR_BASE_PTR)
#define DDR_CR54                                 DDR_CR54_REG(DDR_BASE_PTR)
#define DDR_CR55                                 DDR_CR55_REG(DDR_BASE_PTR)
#define DDR_CR56                                 DDR_CR56_REG(DDR_BASE_PTR)
#define DDR_CR57                                 DDR_CR57_REG(DDR_BASE_PTR)
#define DDR_CR58                                 DDR_CR58_REG(DDR_BASE_PTR)
#define DDR_CR59                                 DDR_CR59_REG(DDR_BASE_PTR)
#define DDR_CR60                                 DDR_CR60_REG(DDR_BASE_PTR)
#define DDR_CR61                                 DDR_CR61_REG(DDR_BASE_PTR)
#define DDR_CR62                                 DDR_CR62_REG(DDR_BASE_PTR)
#define DDR_CR63                                 DDR_CR63_REG(DDR_BASE_PTR)
#define DDR_RCR                                  DDR_RCR_REG(DDR_BASE_PTR)

/**
 * @}
 */ /* end of group DDR_Register_Accessor_Macros */


/**
 * @}
 */ /* end of group DDR_Peripheral */


/* ----------------------------------------------------------------------------
   -- DMA
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup DMA_Peripheral DMA
 * @{
 */

